[{"name":"Mario Feliciano","age":18,"year":2016,"primary_position":"C","eta":null,"report":"","Arm":55,"Changeup":0,"Control":0,"Curveball":0,"Cutter":0,"Fastball":0,"Field":50,"Hit":50,"Power":50,"Run":40,"Slider":0,"Splitter":0.0,"source":"fg_2016 Draft","key_mlbam":null,"uid":"18839_2016","key_uuid":null,"key_bbref":null,"key_bbref_minors":null,"mlb_played_first":null,"birthdate":null,"debut_age":null,"key_fangraphs":"18839"},{"name":"Luis Santana","age":19.9,"year":2019,"primary_position":"2B","eta":2022.0,"report":"The Astros acquired Santana from the Mets for J.D. Davis when Santana was coming off a domestic debut at advanced rookie-level Kingsport, where he hit .348\/.446\/.471 with more walks than strikeouts.\nA curvaceous 5-foot-8, Santana crowds the plate so much that he’s practically straddling it, and his idiosyncratic, low-ball swing enables him to impact pitches that cross the plate beneath his chest as he leans over it. It’s weird, but it works, and Santana looks like he’s going to be a plus hitter who also has a discerning eye for the strike zone, and whose plate crowding gets him hit by pitches so often that it actually matters. He has been hit in 4% of his 611 career plate appearances, which is nearly twice the career rate of active big league HBP leader Shin-Soo Choo (132 HBP, 1.9%) who became the active leader when Chase Utley (204 HBP, 2.5%) retired.\nAthletically, Santana fits at second and third base. His body is pretty maxed out and he’s not likely to grow into sizable raw power, but he runs well, has infield-worthy hands, and an average arm. The combination of his defensive profile and promising feel to hit make him a potential regular. The bat control may be obscuring poor pitch selection.","Arm":50,"Changeup":0,"Control":0,"Curveball":0,"Cutter":0,"Fastball":0,"Field":50,"Hit":60,"Power":45,"Run":50,"Slider":0,"Splitter":0.0,"source":"fg_2019 Report","key_mlbam":null,"uid":"sa921577_2019","key_uuid":null,"key_bbref":null,"key_bbref_minors":null,"mlb_played_first":null,"birthdate":null,"debut_age":null,"key_fangraphs":"sa921577"},{"name":"Parker Bridwell","age":24.4,"year":2016,"primary_position":"RHP","eta":2016,"report":"The Orioles' ninth-round pick in 2009, Bridwell advanced to Double-A for the first time in 2015. He showed more consistency in the Eastern League, posting a sub-4.00 ERA in three of the first four months of the season, only to have his campaign end a month early due to elbow tendinitis. Injuries continued to plague Bridwell in 2016, when he missed more a month of action during the middle of the season as the result of a left rib injury.Bridwell has impressive pure stuff and a track record of missing bats, as he averaged 8.2 strikeouts per nine innings for his career headed into 2016. He throws his fastball downhill from his 6-foot-4 frame, though the velocity tends to vary from outing to outing, as he'll sometimes pitch in the 94-97 mph range but typically sits in the low 90s. His changeup is his out pitch and he also throws a slider, though it's behind the other two pitches.The biggest challenge for Bridwell has been commanding his fastball. When he can throw the pitch for strikes, and complement it with that changeup, he has the potential to dominate. Though he'll remain a starter for now, Bridwell, with his stuff and bat-missing ability, could jump on the fast track to the big leagues with a move to the bullpen.","Arm":0,"Changeup":55,"Control":45,"Curveball":0,"Cutter":0,"Fastball":55,"Field":0,"Hit":0,"Power":0,"Run":0,"Slider":45,"Splitter":0.0,"source":"mlbam","key_mlbam":592170,"uid":"0_2016","key_uuid":"703f7d8c-4c55-4d56-a62f-507119c1a450","key_bbref":"bridwpa01","key_bbref_minors":"bridwe001par","mlb_played_first":2016.0,"birthdate":"1991-08-02T00:00:00.000Z","debut_age":24.4,"key_fangraphs":11502.0},{"name":"Brandon Howlett","age":20.0,"year":2019,"primary_position":"3B","eta":2023.0,"report":"Howlett was a known prospect in Florida for years and was on a trajectory to go in the top five rounds after a strong start to his spring, but he finished poorly, including a brutal NHSI tournament where all 30 teams had multiple scouts on hand. Howlett swung and missed a ton in front of dozens of high level evaluators, when many had pegged him as the sleeper prospect to break out at the event. The Red Sox found after signing him that he had an issue with his contacts, giving him particular trouble in day games (which all of the games at NHSI were), and got him squared away before his pro career began. Howlett hit six homers in 43 pro games with a manageable strikeout rate that surprised many amateur scouts who had discounted his hitting ability earlier that year. He's often compared to Northcut since they both play third base and were widely-scouted later-round finds for Boston. Howlett has a little better feel to hit and ability to tap into his power in game situations, but is a little behind Northcut defensively.","Arm":50,"Changeup":0,"Control":0,"Curveball":0,"Cutter":0,"Fastball":0,"Field":50,"Hit":50,"Power":60,"Run":40,"Slider":0,"Splitter":0.0,"source":"fg_2019 Updated","key_mlbam":null,"uid":"sa3007745_2019","key_uuid":null,"key_bbref":null,"key_bbref_minors":null,"mlb_played_first":null,"birthdate":null,"debut_age":null,"key_fangraphs":"sa3007745"},{"name":"Brendan Donovan","age":21.4,"year":2018,"primary_position":"3B","eta":null,"report":"","Arm":0,"Changeup":0,"Control":0,"Curveball":0,"Cutter":0,"Fastball":0,"Field":0,"Hit":0,"Power":0,"Run":0,"Slider":0,"Splitter":0.0,"source":"fg_2018 Draft","key_mlbam":null,"uid":"sa917924_2018","key_uuid":null,"key_bbref":null,"key_bbref_minors":null,"mlb_played_first":null,"birthdate":null,"debut_age":null,"key_fangraphs":"sa917924"},{"name":"Dane Dunning","age":22,"year":2016,"primary_position":"RHP","eta":null,"report":"","Arm":0,"Changeup":50,"Control":0,"Curveball":0,"Cutter":0,"Fastball":55,"Field":0,"Hit":0,"Power":0,"Run":0,"Slider":60,"Splitter":0.0,"source":"fg_2016 Draft","key_mlbam":null,"uid":"sa827397_2016","key_uuid":null,"key_bbref":null,"key_bbref_minors":null,"mlb_played_first":null,"birthdate":null,"debut_age":null,"key_fangraphs":"sa827397"},{"name":"Richie Shaffer","age":21.8,"year":2013,"primary_position":"3B","eta":2015,"report":"A year after taking Mikie Mahtook from the college hitting ranks, the Rays went that route again in selecting Shaffer from Clemson in the first round. The right-handed hitter was one of the best college power bats in the Draft class. He has plus power to all fields, though there are some holes to his swing that lead to a fair amount of strikeouts. He's played both third and first in the past. Shaffer's plus arm would be just fine at third, but many feel with his limited range (not to mention being blocked by Evan Longoria), first base might be a better long-term home. He might be athletic enough to play right field as well, where his arm and his power bat might profile well.","Arm":60,"Changeup":0,"Control":0,"Curveball":0,"Cutter":0,"Fastball":0,"Field":50,"Hit":50,"Power":50,"Run":40,"Slider":0,"Splitter":0.0,"source":"mlbam","key_mlbam":572128,"uid":"0_2013","key_uuid":"ff04bc4f-df9b-4b8c-bd3b-c7f838d574c1","key_bbref":"shaffri01","key_bbref_minors":"shaffe002ric","mlb_played_first":2015.0,"birthdate":"1991-03-15T00:00:00.000Z","debut_age":23.8,"key_fangraphs":13271.0},{"name":"J.B. Bukauskas","age":21.2,"year":2018,"primary_position":"RHP","eta":2020,"report":"Bukauskas unexpectedly exploded onto the prospect scene in 2014, when he reclassified from a high school junior to a Draft-eligible senior and came out throwing 94-97 mph in his first start of the spring. He asked clubs not to take him because he wanted to attend North Carolina -- the Diamondbacks took a flier on him in the 20th round -- and blossomed into a first-rounder after three years in college. The 2017 Atlantic Coast Conference pitcher of the year, he faltered in the NCAA regional playoffs and slid a bit to the Astros at No. 15, where he signed for $3.6 million.Some scouts believed that Bukauskas had the best 1-2 combination of pitches in the 2017 Draft. Both his mid-90s fastball with sink and his mid-80s slider are at least plus-plus pitches at their best, though he sometimes falls in love with his slider too much and loses fastball command. He'll flash some solid changeups with some armside run, though he needs to employ the pitch more often so he can refine it.Bukauskas toned down his delivery in college, but he's still a 6-foot right-hander who throws with considerable effort, so there's a split camp among evaluators as to whether he can remain a starter. Houston believes he can and his proponents think he compares favorably to Sonny Gray, while others envision him as a closer. A back issue related to a car accident in Spring Training cost him most of the first three months of his first full pro season, but he was back overpowering hitters by July.","Arm":0,"Changeup":50,"Control":50,"Curveball":0,"Cutter":0,"Fastball":70,"Field":0,"Hit":0,"Power":0,"Run":0,"Slider":65,"Splitter":0.0,"source":"mlbam","key_mlbam":656266,"uid":"0_2018","key_uuid":"ca3cf806-df78-49d0-b4ad-bee926e38998","key_bbref":null,"key_bbref_minors":"bukaus000jb-","mlb_played_first":null,"birthdate":"1996-10-11T00:00:00.000Z","debut_age":null,"key_fangraphs":null},{"name":"Touki Toussaint","age":"20","year":2017,"primary_position":"RHP","eta":2019.0,"report":"","Arm":0,"Changeup":55,"Control":40,"Curveball":70,"Cutter":0,"Fastball":60,"Field":0,"Hit":0,"Power":0,"Run":0,"Slider":0,"Splitter":0.0,"source":"fg_2017 Report","key_mlbam":null,"uid":"16929_2017","key_uuid":null,"key_bbref":null,"key_bbref_minors":null,"mlb_played_first":null,"birthdate":null,"debut_age":null,"key_fangraphs":"16929"},{"name":"Wuilmer Becerra","age":null,"year":2017,"primary_position":"OF","eta":2018,"report":"The third player in the big R.A. Dickey trade with the Blue Jays back in December 2012 that netted the Mets Noah Syndergaard and Travis d'Arnaud as well, Becerra's full-season debut in the Mets system in '15 certainly made it look like that trade would be even more one-sided. While he showed some good things with the move up to the Florida State League, a shoulder injury that nagged him all year shut him down in July and required surgery.Back and playing the outfield post-surgery, the hope was that Becerra would get get all of his offensive tools back. The shoulder may have caused his lower power output in St. Lucie in 2016, and the Mets felt that the lack of that threat caused him to become less patient at the plate, leading to a much lower walk rate. That improved a bit in 2017, but the strikeout rate has been high and he hasn't hit for average as he did a year ago. He is capable of making consistent hard line-drive contact. It may take some time for Becerra to be all the way back, especially to unleash what was an above-average arm in right field. He's a good athlete and covers a lot of ground from the corner outfield position. Assuming his shoulder does bounce back, there's no reason to think Becerra can't get back to profiling well as a future right fielder. He is still just 22, with time to put it all together.","Arm":50,"Changeup":0,"Control":0,"Curveball":0,"Cutter":0,"Fastball":0,"Field":50,"Hit":50,"Power":45,"Run":50,"Slider":0,"Splitter":0.0,"source":"mlbam","key_mlbam":610141,"uid":"0_2017","key_uuid":"4fb1cd64-2394-46d9-8a27-02f664ec9bb2","key_bbref":null,"key_bbref_minors":"becerr000wui","mlb_played_first":null,"birthdate":"1994-10-01T00:00:00.000Z","debut_age":null,"key_fangraphs":null}]